In [1]:
%load_ext autoreload
%autoreload 2
%matplotlib inline

In [2]:
from fastbook import *
from fastai.imports import *
from fastai.tabular.all import *
import os

In [3]:
path = Path(os.path.expandvars("${HOME}/.fastai/data/titanic"))
path.ls()

(#4) [Path('/home/jmd/.fastai/data/titanic/gender_submission.csv'),Path('/home/jmd/.fastai/data/titanic/titanic.zip'),Path('/home/jmd/.fastai/data/titanic/train.csv'),Path('/home/jmd/.fastai/data/titanic/test.csv')]

In [4]:
df = pd.read_csv(f"{path}/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Explore Pandas

In [17]:
df.iloc[:,0] # Show all ids

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [18]:
df.iloc[0,:]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [19]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

## Data Setup

In [5]:
def create_vars():
    cat_names  = ['PassengerId', 'Pclass', 
                  'Name', 'Sex', 'SibSp','Parch', 
                  'Ticket', 'Cabin', 'Embarked']
    cont_names = ['Age', 'Fare']
    procs = [Categorify, FillMissing, Normalize]
    return cat_names, cont_names, procs

In [6]:
cat_names, cont_names, procs = create_vars()

In [7]:
dls = TabularDataLoaders.from_df(
    df, path, procs=procs, cat_names=cat_names, cont_names=cont_names,
    y_names="Survived", bs=64)

In [8]:
dls.show_batch()

## Model Setup

In [9]:
learn = tabular_learner(dls)

In [10]:
learn.fit(5, lr=1e-3)

## Data Setup with Tabular Pandas

In [11]:
splits = RandomSplitter(valid_pct=0.2)(range_of(df))

In [42]:
cat_names, cont_names, procs = create_vars()
to = TabularPandas(df, procs=procs,
                   cat_names = cat_names,
                   cont_names = cont_names,
                   y_names='Survived',
                   y_block = CategoryBlock,
                   splits=splits)

In [43]:
to.xs.iloc[:2]

,PassengerId,Pclass,Name,Sex,SibSp,Parch,Ticket,Cabin,Embarked,Age_na,Age,Fare
498,400,1,19,1,2,3,38,63,3,1,-0.343891,2.308472
809,649,1,153,1,2,1,52,138,3,1,0.273986,0.391927

In [44]:
dls = to.dataloaders(bs=64)

In [45]:
dls.show_batch()

In [46]:
learn = tabular_learner(dls, metrics=accuracy)

In [47]:
learn.fit_one_cycle(1)